Documents/УсловияПримененияСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>УсловияПримененияСтавок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИпотечныеСтавки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУсловияПримененияСтавок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаУсловияПримененияСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыУсловийСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Программа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияСтавок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПримененияСтавок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПараметрыПримененияСтавок_Значения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/СхемыУсловийСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>СхемыУсловийСтавки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПрограммыКредитования</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетКомпоновкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПримененияСтавок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПримененияСтавок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанныхОтборы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетКомпоновкиДанныхОтборы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыОтбораОтборы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Элемент</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПримененияСтавок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СортировкаКолонок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПараметрыПримененияСтавок_Значения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сортировка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СортировкаСтрок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПараметрыПримененияСтавок_Значения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сортировка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/УсловияПримененияСтавок/Forms/ФормаВводаЗначения/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Строки = Параметры.Строки;
	Колонки = Параметры.Колонки;
	ОбластьИмя = Параметры.ОбластьИмя;
	Строка = "";
	Колонка = "";

	Соответствие = Новый Соответствие;
		
	Для Каждого Стр Из Параметры.ЗначенияПересечения Цикл
		Тип = Стр.Владелец;
		Если Тип = Строки ИЛИ Тип = Колонки Тогда
			Продолжить;
		КонецЕсли;
		
		Массив = Соответствие.Получить(Тип);
		Если Массив = Неопределено Тогда
			Массив = Новый Массив;
		КонецЕсли;
		СтруктураВозврата = Новый Структура("Фактор, Значение");
		СтруктураВозврата.Фактор = Тип;
		СтруктураВозврата.Значение = Стр;
		Массив.Добавить(СтруктураВозврата);
		Соответствие.Вставить(Тип, Массив);
	КонецЦикла;
	ВсеКомбинации = Справочники.СхемыУсловийСтавки.ПолучитьВсеКомбинации(Соответствие);
	
	
	i=1;
	Для Каждого Стр Из ВсеКомбинации Цикл
		СоздатьГруппуНаСервере(Стр,i);
		i=i+1;
	КонецЦикла;
	
	Элементы.Надпись.Заголовок = "" + Колонки + " " + Колонка + " и " + Строки + " " + Строка;
	ЭтаФорма.Заголовок = Элементы.Надпись.Заголовок;
	ЭтаФорма.АвтоЗаголовок = Ложь;
	
	
КонецПроцедуры

  &НаСервере
  Процедура СоздатьГруппуНаСервере(Стр,i)
	 
	 КолонкиТЧ = Стр.Владелец().Колонки;
	 ГруппаТЧ = ТЧ.ПолучитьЭлементы().Добавить();
	 ГруппаТЧ.Редактирование = Истина;
	 ГруппаТЧ.Группа = i;

	 Дерево = Новый ДеревоЗначений;
	 Дерево.Колонки.Добавить("Параметр",,"Параметр");
	 Дерево.Колонки.Добавить("Значение",,"Значение");
	 Дерево.Строки.Добавить();
	 
	 НаименованиеГруппы = "";
	 
	 
	 Для Каждого Колонка Из КолонкиТЧ Цикл
	 СтрокаТЧ = ГруппаТЧ.ПолучитьЭлементы().Добавить();	 
	 СтрокаТЧ.Параметр = Стр[Колонка.Имя];
	 СтрокаТЧ.Тип = Стр[Колонка.Имя].Владелец;
	 НаименованиеГруппы = НаименованиеГруппы + ?(НаименованиеГруппы="", "", " И ") 
	 + СтрокаТЧ.Тип.Наименование + "=""" + СтрокаТЧ.Параметр.Наименование+"""";
	 КонецЦикла;
 
 	 ГруппаТЧ.Параметр = НаименованиеГруппы;

	 	 
 КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ПеренестиЗначенияНаСервере();
	ЭтаФорма.Закрыть();
	 
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиЗначенияНаСервере()
	
	ЭлементыТЧ = ТЧ.ПолучитьЭлементы();
	
	Для Каждого Группа Из ЭлементыТЧ Цикл
		СоставГруппы = Группа.ПолучитьЭлементы();
		Для Каждого Стр Из СоставГруппы Цикл
		ВладелецФормы.ЗаполнитьЗначенияЯчейки(Стр.Тип, Стр.Параметр,ОбластьИмя, Группа.Значение, Группа.Группа);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗначенияСтавок = ВладелецФормы.Объект.ЗначенияСтавок;
	
	ЭлементыТЧ = ТЧ.ПолучитьЭлементы();
	Для Каждого Стр Из ЭлементыТЧ Цикл
	Отбор = Новый Структура("Расположение, Группа", ОбластьИмя, Стр.Группа);
	СтрокиТаблицы = ЗначенияСтавок.НайтиСтроки(Отбор);
	Для Каждого СтрТаб Из СтрокиТаблицы	Цикл
		Стр.Значение = СтрТаб.Ставка;
		Прервать;
	КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные.Редактирование Тогда
		Элементы.ТЧ.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ТЧ.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры
